#### IsNameUnique Method (Document, String)

---

|  |
| --- |
| FilterElement Class   See Also |

Determines whether the given name could be applied to a new FilterElement, or if it could not be applied because the name is already in use.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool IsNameUnique( 	Document aDocument, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsNameUnique ( _ 	aDocument As Document, _ 	name As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsNameUnique( 	Document^ aDocument,  	String^ name ) ``` |

#### Parameters

aDocument
:   Type:  Autodesk.Revit.DB Document
     The document in which the name is being tested for uniqueness.

name
:   Type:  System String
     The name tested for uniqueness.

#### Return Value

Returns true if the name is unique, and false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilterElement Class

IsNameUnique Overload

Autodesk.Revit.DB Namespace